<a href="https://colab.research.google.com/github/rifyalt/digitalskola/blob/main/Homework_1_%7C_Week_7_%7C_Rifyal_Tumber.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd, numpy as np
from google.colab import drive
drive.mount('/content/gdrive') # otorisasi ke gmail lalu copy link untuk diinput

Mounted at /content/gdrive

1. What is the comparison between passengers that Survived and Not Survived?

* Sumber data : https://www.kaggle.com/c/titanic/data?select=train.csv (sudah disimpan pada gdrive)

In [ ]:
path = 'gdrive/MyDrive/1.File Vial/Kursus/8.Digital Skola/Tugas/Individu/WEEK-7/HW-1/train.csv'
df = pd.read_csv(path, delimiter=',')
df.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [ ]:
df.shape

(891, 12)

1. What is the comparison between passengers that Survived and Not Survived?

In [ ]:
# Jawaban Soal No.1

print('Perbandingannya adalah sebagai berikut:')
df['Survived'].value_counts()

# 0 = Not Survived
# 1 = Survived

Perbandingannya adalah sebagai berikut:

0    549
1    342
Name: Survived, dtype: int64

In [ ]:
survivor_count = df['Survived'].sum()
print('Total yang survive sebanyak' ,survivor_count, 'jiwa')

Total yang survive sebanyak 342 jiwa

In [ ]:
print('Jumlah penumpang Pada Setiap Kelas adalah sbb:')
df['Pclass'].value_counts()

Jumlah penumpang Pada Setiap Kelas adalah sbb:

3    491
1    216
2    184
Name: Pclass, dtype: int64

2. How many Survived passengers from each pclass?

In [ ]:

# Jawaban Soal No.2

print('Jumlah penumpang yang selamat dan tidak selamat pada setiap Kelas sbb:')
kelas = df['Survived'].groupby(df['Pclass']).value_counts()
kelas

Jumlah penumpang yang selamat dan tidak selamat pada setiap Kelas sbb:

Pclass  Survived
1       1           136
        0            80
2       0            97
        1            87
3       0           372
        1           119
Name: Survived, dtype: int64

In [ ]:
# How many Survived passengers from each pclass?
# Jawaban Soal No.2 jika dibuat percentage

total_passenger_count = len(df['Pclass'])
first_class_count = (df['Pclass'] == 1).sum()
second_class_count = (df['Pclass'] == 2).sum()
third_class_count = (df['Pclass'] == 3).sum()

per_first_class =  first_class_count / total_passenger_count * 100
per_second_class = second_class_count / total_passenger_count * 100
per_third_class = third_class_count / total_passenger_count * 100

In [ ]:
print('Jumlah yang selamat dari masing-masing class adalah:')
print('First class  = ', per_first_class, '%','| Count: ', first_class_count)
print('Second class = ', per_second_class, ' %', '| Count: ', second_class_count)
print('Third class  = ', per_third_class, '%','| Count: ', third_class_count)

Jumlah yang selamat dari masing-masing class adalah:
First class  =  24.242424242424242 % | Count:  216
Second class =  20.65095398428732  % | Count:  184
Third class  =  55.106621773288445 % | Count:  491

3. What is the average and median age of passengers that Survived and Not Survived?

In [ ]:
# Jawaban Soal No.3

df.groupby('Survived').mean()[['Age']] # Average

                Age
Survived
0         30.626179
1         28.343690

In [ ]:
df.groupby('Survived').median()[['Age']] # Median

           Age
Survived
0         28.0
1         28.0

In [93]:
ages_list = df_age['Age'].unique()
ages_list.sort()
ages_list

array([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16,
       17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33,
       34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50,
       51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 70,
       71, 74, 80])

In [94]:
df.head()

   PassengerId  Survived  Pclass  ... Cabin Embarked  age_interval
0            1         0       3  ...   NaN        S         25-35
1            2         1       1  ...   C85        C         25-35
2            3         1       3  ...   NaN        S         25-35
3            4         1       1  ...  C123        S         25-35
4            5         0       3  ...   NaN        S         25-35

[5 rows x 13 columns]

**4. Create a new column named “age_interval” with this rules :**

*   Age < 25 : “< 25”
*   Age from 25 - 35 : “25 - 35”
*   Age from 36 - 50 : “36 - 50”
*   Age > 50 : “ > 50”

In [111]:
age_labels = ['< 25', '25-35', '36-50', '>51']
df['age_interval'] = pd.cut(df.Age, range(0, 81, 20), right=False, labels=age_labels)

In [112]:
df.head(10) # 10 teratas

   PassengerId  Survived  Pclass  ... Cabin Embarked  age_interval
0            1         0       3  ...   NaN        S         25-35
1            2         1       1  ...   C85        C         25-35
2            3         1       3  ...   NaN        S         25-35
3            4         1       1  ...  C123        S         25-35
4            5         0       3  ...   NaN        S         25-35
5            6         0       3  ...   NaN        Q           NaN
6            7         0       1  ...   E46        S         36-50
7            8         0       3  ...   NaN        S          < 25
8            9         1       3  ...   NaN        S         25-35
9           10         1       2  ...   NaN        C          < 25

[10 rows x 13 columns]

In [113]:
df.tail(10) # 10 terbawah

     PassengerId  Survived  Pclass  ... Cabin Embarked  age_interval
881          882         0       3  ...   NaN        S         25-35
882          883         0       3  ...   NaN        S         25-35
883          884         0       2  ...   NaN        S         25-35
884          885         0       3  ...   NaN        S         25-35
885          886         0       3  ...   NaN        Q         25-35
886          887         0       2  ...   NaN        S         25-35
887          888         1       1  ...   B42        S          < 25
888          889         0       3  ...   NaN        S           NaN
889          890         1       1  ...  C148        C         25-35
890          891         0       3  ...   NaN        Q         25-35

[10 rows x 13 columns]

5. After creating the new column in question number 4, which age interval has the highest percentage of Survived? (clue : percentage of survived is total survived per age interval / total all passengers in that age interval)

In [114]:
# Jawaban soal 5

interval = df['age_interval'].value_counts()
interval

25-35    387
< 25     164
36-50    137
>51       25
Name: age_interval, dtype: int64

In [115]:
missing_ages = df[df['Age'].isnull()] # cari NaN

In [116]:
missing_ages # ada 177 penumpang dan 13 kolom yang berstatus NaN

     PassengerId  Survived  Pclass  ... Cabin Embarked  age_interval
5              6         0       3  ...   NaN        Q           NaN
17            18         1       2  ...   NaN        S           NaN
19            20         1       3  ...   NaN        C           NaN
26            27         0       3  ...   NaN        C           NaN
28            29         1       3  ...   NaN        Q           NaN
..           ...       ...     ...  ...   ...      ...           ...
859          860         0       3  ...   NaN        C           NaN
863          864         0       3  ...   NaN        S           NaN
868          869         0       3  ...   NaN        S           NaN
878          879         0       3  ...   NaN        S           NaN
888          889         0       3  ...   NaN        S           NaN

[177 rows x 13 columns]

In [117]:
ages_list

array([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16,
       17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33,
       34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50,
       51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 70,
       71, 74, 80])

In [118]:
df_ages_survival = pd.DataFrame(index=ages_list, columns=['Survived', 'Deaths', 'Total', 'Percentage'])

df_ages_survival['Survived'] = df_age.groupby('Age')['Survived'].sum()
df_ages_survival['Total'] = df_age.groupby('Age').count()
df_ages_survival['Deaths'] = df_ages_survival['Total'] - df_ages_survival['Survived']
df_ages_survival['Percentage'] = round(df_age.groupby('Age')['Survived'].mean() * 100, 2)

In [119]:
df_ages_survival

    Survived  Deaths  Total  Percentage
0          7       0      7      100.00
1          5       2      7       71.43
2          3       7     10       30.00
3          5       1      6       83.33
4          7       3     10       70.00
..       ...     ...    ...         ...
66         0       1      1        0.00
70         0       3      3        0.00
71         0       2      2        0.00
74         0       1      1        0.00
80         1       0      1      100.00

[71 rows x 4 columns]